1c/Catalogs/МИКО_аиОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МИКО_аиОпросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетчикВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОпроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>questionId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>questionText</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>lang</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>questionId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>action</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>nextQuestion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/Catalogs/МИКО_аиОпросы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВопросыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВариантыОтветов.Видимость = Истина;
	Элементы.ВариантыОтветов.ОтборСтрок = Новый ФиксированнаяСтруктура("questionId", ТекущиеДанные.questionId);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.questionId) Тогда
		ТекущиеДанные.questionId = Объект.СчетчикВопросов;
		Объект.СчетчикВопросов = Объект.СчетчикВопросов + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущийВопрос = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущийВопрос = Неопределено Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущиеДанные Из Объект.ВариантыОтветов Цикл
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.questionId) Тогда
			ТекущиеДанные.questionId = ТекущийВопрос.questionId;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПослеУдаления(Элемент) 
	
	СтрокиКУдалению = Новый Массив();
	Для каждого ТекущиеДанные Из Объект.ВариантыОтветов Цикл
		Если Объект.Вопросы.НайтиСтроки(Новый Структура("questionId", ТекущиеДанные.questionId)).Количество()=0 Тогда
			СтрокиКУдалению.Добавить(Объект.ВариантыОтветов.Индекс(ТекущиеДанные));
		КонецЕсли;
		Если Объект.Вопросы.НайтиСтроки(Новый Структура("questionId", ТекущиеДанные.nextQuestion)).Количество()=0 Тогда
			ТекущиеДанные.nextQuestion = "";
		КонецЕсли;            
	КонецЦикла; 
	
	Для каждого Индекс Из СтрокиКУдалению Цикл
	 	Объект.ВариантыОтветов.Удалить(Индекс);
	КонецЦикла;
		
КонецПроцедуры
